\"Where do animals' winter coats come from?\\nWhen it gets cold outside, you can throw on a warm jacket or coat. But have you ever wondered how animals stay warm when the seasons change?\\n\\n\"Animals pretty much have three options when it comes to the wintertime,\" said Jeannine Fleegle. She's a wildlife biologist for the Pennsylvania Game Commission. Biologists are scientists who study living things. \n\\\nOne option is that animals can leave, known as migration, Fleegle said. Migration is the movement of animals from one place to another. Migrations often happen at specific times of the year.\\\n\\\nA second option is they \"can do some sort of hibernation,\" Fleegle said. Hibernation is a biological process where an animal passes the winter in a resting state. They can do this in cozy dens or underground.\\n\\nThe third option is that \"they can stay and be active all year long,\" she said. Some animals use that third option. And for them, a change of wardrobe is in order.\\n\\nColor Change\\nMany animals change the colors of their coats when winter comes. Snowshoe hares, Arctic foxes and some weasels are examples.\\n\\nThese animals have gray or brown coats during the summer. Their coats match the surroundings in which they live. But their coats turn white when the temperature drops.\\n\\nOne reason for this color change is that in the snow, their white coats help hide them from predators. A predator is an animal that eats other animals. The white fur also helps these animals hide when they are out hunting for other critters.\\n\\nThick Underfur\\nWhite-tailed deer are found in most of the United States. These deer are reddish-brown in the summertime, said Fleegle. But when the days start getting shorter, their fur switches to a light-gray color. They do this in preparation for winter. This helps the animals blend in with their changing backgrounds. At the same time, there's a much more important shift taking place.\\n\\nDeer actually have two layers of fur, Fleegle said. The top coat is full of what scientists call guard hairs. These hairs are long and sometimes hollow. That's the fur we usually see. But beneath the top coat, there's a much thicker layer of fur called underfur. It helps keep the deer warm. \"The underfur is five times as dense as those guard hairs,\" she said.\\n\\nThe deer's underfur traps a layer of air, and that air gets warmed by the body. It's like a lining in a winter coat. \"And that's what keeps the deer warm in the wintertime,\" Fleegle said.\\n\\nWhen temperatures start warming up in the spring, the deer shed all their underfur. If they kept it, it would make them too warm.\\n\\n\"A deer's summer coat does not have underfur,\" said Fleegle. \"So there's a lot of airflow, which is basically deer air conditioning.\"\\n\\nDeer shed a lot of fur in the springtime. Look carefully and you might see clumps of it in the woods if you go for a hike.\"\\n Brr. When you're waiting for the bus or walking to school, have you noticed that it's getting chilly in the mornings?\\n Fortunately, humans can throw on a warm jacket or coat when it gets cold. But have you ever wondered how animals make do when the seasons change? \\n \"Animals pretty much have three options when it comes to the wintertime,\" says Jeannine Fleegle, a wildlife biologist for the Pennsylvania Game Commission. \"They can either leave, known as migration. They can do some sort of hibernation. Or they can stay and be active all year long.\" \\n \\n Of course, for deer and other mammals that use the third option, a change of wardrobe is in order. \\n Many animals change color when winter comes. Snowshoe hares, Arctic foxes and some weasels are examples of creatures that are gray or brown during the summer but switch to stark-white colors when the temperature drops. One reason for this is that the new look helps them hide from predators as well as the prey that they hunt.\\n \\n But you don't have to go beyond the Arctic Circle to witness drastic animal coat changes. White-tailed deer are reddish-brown in the summertime, says Fleegle, but when the days start getting shorter, their bodies switch to a light-gray in preparation for winter. While this helps the animals blend in with their changing backgrounds, there's a much more important shift taking place. \\n \\n Deer actually have two layers of fur, says Fleegle. The top coat is full of what scientists call \"guard hairs,\" which are longer and sometimes hollow. But beneath those, there's a much thicker layer of underfur.\\n\\n \"That's really what gives a deer's coat its insulative value,\" says Fleegle. \"The underfur is five times as dense as those guard hairs.\" \\n\\n In fact, Fleegle says a white-tailed deer's undercoat is thicker than sheep wool. \"That underfur traps a layer of air, and that air gets warmed by the body,\" she explains. \"And that's what keeps the deer warm in the wintertime.\" \\n\\n When the world starts warming up again in the spring, the deer shed all their underfur, because keeping it would make them run the risk of overheating — which can be just as dangerous as freezing to death. \\n\\n \"A deer's summer coat does not have underfur,\" says Fleegle. \"So there's a lot of airflow, which is basically deer air conditioning.\" \\n\\n Deer shed so much fur in the springtime, that you might see clumps of it in the woods if you go for a hike. \"We call it 'when deer blow their coats,'\" says Fleegle, \"because it looks like their inner coat has been blown apart.\"